# Aggregation and Grouping

In data analysis, a key part is making summaries quickly. This involves figuring out aggregations like `sum`, `average`, `median`, `min`, and `max`. These numbers give us an idea about big sets of data. In this chapter, we'll look into how to do these summaries in Pandas.

In [2]:
import pandas as pd

salary_df = pd.read_csv('salary.csv')
salary_df

    salary  gender departm  years   age  publications
0    86285       0     bio   26.0  64.0            72
1    77125       0     bio   28.0  58.0            43
2    71922       0     bio   10.0  38.0            23
3    70499       0     bio   16.0  46.0            64
4    66624       0     bio   11.0  41.0            23
..     ...     ...     ...    ...   ...           ...
72   53662       1   neuro    1.0  31.0             3
73   57185       1    stat    9.0  39.0             7
74   52254       1    stat    2.0  32.0             9
75   61885       1    math   23.0  60.0             9
76   49542       1    math    3.0  33.0             5

[77 rows x 6 columns]

In [3]:
salary_df.describe()

              salary     gender      years        age  publications
count      77.000000  77.000000  76.000000  76.000000     77.000000
mean    67748.519481   0.142857  14.973684  45.486842     21.831169
std     15100.581435   0.387783   8.617770   9.005914     15.240530
min     44687.000000   0.000000   1.000000  31.000000      3.000000
25%     57185.000000   0.000000   8.000000  38.000000      9.000000
50%     62607.000000   0.000000  14.000000  44.000000     19.000000
75%     75382.000000   0.000000  23.000000  53.000000     33.000000
max    112800.000000   2.000000  34.000000  65.000000     72.000000

In [4]:
salary_df['salary'].describe()

count        77.000000
mean      67748.519481
std       15100.581435
min       44687.000000
25%       57185.000000
50%       62607.000000
75%       75382.000000
max      112800.000000
Name: salary, dtype: float64

In [5]:
salary_df['salary'].mean()

67748.51948051948

In [6]:
salary_df['salary'].median()

62607.0

In [18]:
salary_df.mean(numeric_only=True)

salary          67748.519481
gender              0.142857
years              14.973684
age                45.486842
publications       21.831169
dtype: float64

In [8]:
salary_df[['salary', 'age', 'years']].mean()

salary    67748.519481
age          45.486842
years        14.973684
dtype: float64

In [13]:
salary_df['salary'].agg(['max', 'min'])

max    112800
min     44687
Name: salary, dtype: int64

In [16]:
salary_df[['salary', 'age']].agg(['max', 'min'])

     salary   age
max  112800  65.0
min   44687  31.0

In [17]:
salary_df[['salary', 'age']].agg({'salary':'sum',
                                   'age':'mean'})

salary    5.216636e+06
age       4.548684e+01
dtype: float64

## groupby: Split, Apply, Combine

Simple aggregations can give you a flavor of your dataset, but often we would prefer to aggregate conditionally on some label or index: this is implemented in the so-called `groupby` operation.
The name "group by" comes from a command in the SQL database language, but it is perhaps more illuminative to think of it in the terms first coined by Hadley Wickham of Rstats fame: *split, apply, combine*.

### Split, Apply, Combine

A canonical example of this split-apply-combine operation, where the "apply" is a summation aggregation, is illustrated in this figure:

<div class="img-div-any-width" markdown="0">
  <img src="../../images/pandas/split-apply-combine.png"/>
  <br />
</div>

In [19]:
salary_df.groupby('departm')

In [20]:
salary_df.groupby('departm')['salary']

In [21]:
salary_df.groupby('departm')['salary'].mean()

departm
bio        63094.687500
chem       66003.454545
geol       73548.500000
math       60920.875000
neuro      76465.600000
physics    67987.000000
stat       67242.800000
Name: salary, dtype: float64

In [23]:
salary_df.groupby('departm')['salary'].sum()

departm
bio        1009515
chem        726038
geol        294194
math        487367
neuro      1146984
physics     543896
stat       1008642
Name: salary, dtype: int64

In [24]:
salary_df.groupby('departm').salary.sum()

departm
bio        1009515
chem        726038
geol        294194
math        487367
neuro      1146984
physics     543896
stat       1008642
Name: salary, dtype: int64

In [22]:
salary_df['salary'].mean()

67748.51948051948

In [25]:
salary_df.groupby('departm')['salary'].min()

departm
bio        52968
chem       44687
geol       52766
math       49542
neuro      53662
physics    54076
stat       51391
Name: salary, dtype: int64

In [26]:
salary_df.groupby('departm')['salary'].max()

departm
bio         86285
chem        97630
geol       104828
math        82142
neuro      112800
physics     96936
stat       106412
Name: salary, dtype: int64

In [27]:
salary_df.groupby('departm')['salary'].agg(['min', 'max'])

           min     max
departm
bio      52968   86285
chem     44687   97630
geol     52766  104828
math     49542   82142
neuro    53662  112800
physics  54076   96936
stat     51391  106412

In [30]:
lst_col = ['age', 'publications']
salary_df.groupby('departm')[lst_col].agg(['min', 'max'])

          age       publications
          min   max          min max
departm
bio      38.0  64.0            4  72
chem     34.0  65.0           12  43
geol     37.0  50.0           12  44
math     33.0  60.0            5   9
neuro    31.0  49.0            3  49
physics  32.0  56.0            4  19
stat     32.0  59.0            4  42

In [37]:
salary_df.iloc[:, [0, 3, 2]].groupby('departm').agg(['min', 'max'])

        salary         years
           min     max   min   max
departm
bio      52968   86285   2.0  28.0
chem     44687   97630   4.0  34.0
geol     52766  104828   4.0  11.0
math     49542   82142   3.0  23.0
neuro    53662  112800   1.0  20.0
physics  54076   96936   2.0  26.0
stat     51391  106412   2.0  29.0

In [ ]:

salary_df.groupby('departm')[['age', 'publications']].agg(['min', 'max'])